---
kind: method
id: M:Autodesk.Revit.DB.DefinitionBindingMapIterator.#ctor
source: html/22af8a76-3fe9-174c-e831-843b919c061d.htm
---
# Autodesk.Revit.DB.DefinitionBindingMapIterator.#ctor Method

For Internal Use Only.

## Syntax (C#)
```csharp
public DefinitionBindingMapIterator()
```

## Remarks
This constructor is exposed to enable support for COM interop only. This object should never be created by the developer.